{
  "intro": "Damaged or stale products must be recorded in SAP to keep inventory accurate. Follow these steps and stage items in the correct area.",
  "reasonCodes": [
    {
      "code": "DB",
      "title": "Damaged — divert",
      "dept": "Grocery / Frozen",
      "desc": "Crushed packaging, leaking, broken seal, or otherwise unsellable; divert per store process."
    },
    {
      "code": "SB",
      "title": "Expired / Stale — discard",
      "dept": "Dairy (and other dated items)",
      "desc": "Past best-before or stale. Record as scrap and discard per food safety rules."
    }
  ],
  "steps": [
    "Log into the Zebra handheld.",
    "Open: 2. Goods Movements → 1. Scrap.",
    "Scan the damaged/expired product. On the first scan, choose the correct reason code (DB or SB).",
    "Continue scanning items. Use the same reason code unless it changes.",
    "Review the list and confirm quantities.",
    "Press F12 to post the scrap document."
  ],
  "placement": [
    {
      "title": "Grocery damages",
      "body": "After scanning, place items in the APS section (blue door near the damages area). Use banana boxes from produce for storing damage products."
    },
    {
      "title": "Important",
      "body": "Do NOT place frozen or leaking items in the APS area. Follow food-safety and store policy."
    }
  ],
  "candyCredits": {
    "title": "Candy / Chocolate (Now Scrap as SB)",
    "intro": "Candy credits are no longer done via cycle counts. Simply SCRAP them using reason code SB, record the document number, box them, and print the scrap report.",
    "brands": ["Nestle", "Ferrero", "Mars", "Lindt", "Wrigley"],
    "handheldMenu": "2. Goods Movements → 1. Scrap",
    "steps": [
      "Open: 2. Goods Movements → 1. Scrap on the Zebra.",
      "Scan each candy/chocolate item and select reason code SB (Expired/Stale — discard).",
      "Confirm quantities and POST the scrap.",
      "After submitting, NOTE DOWN the SAP goods movement document number.",
      "Place the scrapped candy in banana boxes for staging."
    ],
    "report": {
      "title": "Print the Scrap (Goods Movement) Report",
      "path": "Desktop → Store Page → Reports → Goods Movement Report",
      "steps": [
        "Open the Goods Movement Report.",
        "Search using the SAP document number you noted after posting.",
        "Open the matching record and print the report for store records/vendor as needed."
      ]
    },
    "example": "You scrap 12 expired chocolate bars as SB and post. The screen shows a document number (e.g., 500123456). Write it down, put items in banana boxes, then go to Store Page → Reports → Goods Movement Report, search 500123456, and print."
  }
}
